In [5]:
import pandas as pd

df1 = pd.DataFrame({
    "city": ["A", "B", "C"],
    "day1": [11,24,18],
    "day2": [21,14,11],
    "day3": [21,24,15],
    "day4": [31,42,38],
})
df1

  city  day1  day2  day3  day4
0    A    11    21    21    31
1    B    24    14    24    42
2    C    18    11    15    38

In [6]:
df1.melt(id_vars=['city'])

   city variable  value
0     A     day1     11
1     B     day1     24
2     C     day1     18
3     A     day2     21
4     B     day2     14
5     C     day2     11
6     A     day3     21
7     B     day3     24
8     C     day3     15
9     A     day4     31
10    B     day4     42
11    C     day4     38

In [9]:
df1.melt(id_vars=['city'], var_name='date', value_name='temperature')

   city  date  temperature
0     A  day1           11
1     B  day1           24
2     C  day1           18
3     A  day2           21
4     B  day2           14
5     C  day2           11
6     A  day3           21
7     B  day3           24
8     C  day3           15
9     A  day4           31
10    B  day4           42
11    C  day4           38

In [12]:
df1.melt(id_vars=['city'], var_name='date', value_name='temperature').sort_values(by='city')

   city  date  temperature
0     A  day1           11
3     A  day2           21
6     A  day3           21
9     A  day4           31
1     B  day1           24
4     B  day2           14
7     B  day3           24
10    B  day4           42
2     C  day1           18
5     C  day2           11
8     C  day3           15
11    C  day4           38

In [13]:
df1.melt(id_vars=['city'], var_name='date', value_name='temperature').sort_values(by='city').reset_index(drop=True)

   city  date  temperature
0     A  day1           11
1     A  day2           21
2     A  day3           21
3     A  day4           31
4     B  day1           24
5     B  day2           14
6     B  day3           24
7     B  day4           42
8     C  day1           18
9     C  day2           11
10    C  day3           15
11    C  day4           38